#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/1f978ec8-dba0-4b62-ad33-9df47f22d961/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # newrelic_entity_tags.basic_dashboard will be created
  + resource "newrelic_entity_tags" "basic_dashboard" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "terraform"
          + values = [
              + "true",
            ]
        }
    }

  # newrelic_one_dashboard_json.basic_dashboard will be created
  + resource "newrelic_one_dashboard_json" "basic_dashboard" {
      + account_id = (known after apply)
      + guid       = (known after apply)
      + id         = (known after apply)
      + json       = jsonencode(
            {
              + description = null
              + name        = "JSON Static - by Terraform new change"
              + pages       = [
                  + {
                      + description = null
                      + name        = "Public API"
                      + widgets     = [
                          + {
                              + layout            = {
                                  + column = 1
                                  + height = 4
                                  + row    = 1
                                  + width  = 3
                                }
                              + linkedEntityGuids = null
                              + rawConfiguration  = {
                                  + facet           = {
                                      + showOtherSeries = true
                                    }
                                  + legend          = {
                                      + enabled = true
                                    }
                                  + nrqlQueries     = [
                                      + {
                                          + accountId = 3491187
                                          + query     = "SELECT count(*) from Public_APICall facet api since 1 hour ago"
                                        },
                                    ]
                                  + platformOptions = {
                                      + ignoreTimeRange = false
                                    }
                                }
                              + title             = ""
                              + visualization     = {
                                  + id = "viz.pie"
                                }
                            },
                          + {
                              + layout            = {
                                  + column = 4
                                  + height = 4
                                  + row    = 1
                                  + width  = 4
                                }
                              + linkedEntityGuids = null
                              + rawConfiguration  = {
                                  + facet           = {
                                      + showOtherSeries = false
                                    }
                                  + legend          = {
                                      + enabled = true
                                    }
                                  + nrqlQueries     = [
                                      + {
                                          + accountId = 3491187
                                          + query     = "SELECT average(duration) from Public_APICall facet api  timeseries 1 hour since 1 week ago"
                                        },
                                    ]
                                  + platformOptions = {
                                      + ignoreTimeRange = false
                                    }
                                  + yAxisLeft       = {
                                      + zero = true
                                    }
                                }
                              + title             = "Avergae duration by API Call"
                              + visualization     = {
                                  + id = "viz.line"
                                }
                            },
                        ]
                    },
                ]
              + permissions = "PUBLIC_READ_WRITE"
            }
        )
      + permalink  = (known after apply)
      + updated_at = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + basic_dashboard = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # newrelic_entity_tags.basic_dashboard will be created%0A  + resource "newrelic_entity_tags" "basic_dashboard" {%0A      + guid = (known after apply)%0A      + id   = (known after apply)%0A%0A      + tag {%0A          + key    = "terraform"%0A          + values = [%0A              + "true",%0A            ]%0A        }%0A    }%0A%0A  # newrelic_one_dashboard_json.basic_dashboard will be created%0A  + resource "newrelic_one_dashboard_json" "basic_dashboard" {%0A      + account_id = (known after apply)%0A      + guid       = (known after apply)%0A      + id         = (known after apply)%0A      + json       = jsonencode(%0A            {%0A              + description = null%0A              + name        = "JSON Static - by Terraform new change"%0A              + pages       = [%0A                  + {%0A                      + description = null%0A                      + name        = "Public API"%0A                      + widgets     = [%0A                          + {%0A                              + layout            = {%0A                                  + column = 1%0A                                  + height = 4%0A                                  + row    = 1%0A                                  + width  = 3%0A                                }%0A                              + linkedEntityGuids = null%0A                              + rawConfiguration  = {%0A                                  + facet           = {%0A                                      + showOtherSeries = true%0A                                    }%0A                                  + legend          = {%0A                                      + enabled = true%0A                                    }%0A                                  + nrqlQueries     = [%0A                                      + {%0A                                          + accountId = 3491187%0A                                          + query     = "SELECT count(*) from Public_APICall facet api since 1 hour ago"%0A                                        },%0A                                    ]%0A                                  + platformOptions = {%0A                                      + ignoreTimeRange = false%0A                                    }%0A                                }%0A                              + title             = ""%0A                              + visualization     = {%0A                                  + id = "viz.pie"%0A                                }%0A                            },%0A                          + {%0A                              + layout            = {%0A                                  + column = 4%0A                                  + height = 4%0A                                  + row    = 1%0A                                  + width  = 4%0A                                }%0A                              + linkedEntityGuids = null%0A                              + rawConfiguration  = {%0A                                  + facet           = {%0A                                      + showOtherSeries = false%0A                                    }%0A                                  + legend          = {%0A                                      + enabled = true%0A                                    }%0A                                  + nrqlQueries     = [%0A                                      + {%0A                                          + accountId = 3491187%0A                                          + query     = "SELECT average(duration) from Public_APICall facet api  timeseries 1 hour since 1 week ago"%0A                                        },%0A                                    ]%0A                                  + platformOptions = {%0A                                      + ignoreTimeRange = false%0A                                    }%0A                                  + yAxisLeft       = {%0A                                      + zero = true%0A                                    }%0A                                }%0A                              + title             = "Avergae duration by API Call"%0A                              + visualization     = {%0A                                  + id = "viz.line"%0A                                }%0A                            },%0A                        ]%0A                    },%0A                ]%0A              + permissions = "PUBLIC_READ_WRITE"%0A            }%0A        )%0A      + permalink  = (known after apply)%0A      + updated_at = (known after apply)%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + basic_dashboard = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @anu1101, Action: `pull_request`, Working Directory: `/home/runner/work/newrelic_terraform/newrelic_terraform`, Workflow: `Terraform`*